/*
 * =============================================================================
 *
 *       Filename:  工程共有函数库文件集合 
 *
 *    Description:  类介绍 
 *
 *        Version:  1.0
 *        Created:  2021年12月15日 
 *       Revision:  1 
 *       Compiler:  gcc
 *
 *         Author:  kevin.wang 
 *   Organization:  
 *
 * =============================================================================
 */
#include <mcs51/C8051F920.h>

/* 
 * ===  FUNCTION  =============================================================
 *         Name:  init_frame
 *  Description:  初始化系统框架 
 * ============================================================================
 */
int init_frame()
{
	return 0;
}

/* 
 * ===  FUNCTION  =============================================================
 *         Name:  asm_delay
 *  Description:  汇编语句的延迟函数 
 * ============================================================================
 */
void asm_delay(int times)
{
	for (int i = 0; i < times; i++) {
	// 关键代码进行汇编的内嵌
__asm
		nop
__endasm;
		
	}
}
