#include 	"abstraction.h"

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  Abstraction
 *  Description:  默认构造函数 
 * =====================================================================================
 */
Abstraction::Abstraction () {
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  ~Abstraction
 *  Description:  默认析构函数 
 * =====================================================================================
 */
Abstraction::~Abstraction () {
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  Abstraction  
 *  Description:  拷贝构造函数 
 * =====================================================================================
 */
Abstraction::Abstraction(const Abstraction& theclass) {
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  TemplateMethod
 *  Description:  模板函数 
 * =====================================================================================
 */
void Abstraction::TemplateMethod () {
	return;
}
