/*
 * =============================================================================
 *
 *       Filename:  serials.c
 *
 *    Description:  进行窜口的初始化操作 
 *
 *        Version:  1.0
 *        Created:  2021年12月15日 
 *       Revision:  1 
 *       Compiler:  gcc
 *
 *         Author:  kevin.wang 
 *   Organization:  
 *
 * =============================================================================
 */

/* 
 * ===  FUNCTION  =============================================================
 *         Name:  init_serial
 *  Description:  初始化串口 
 * ============================================================================
 */
int init_serial() {
	return 0;
}
