/*
 * =============================================================================
 *
 *       Filename:  basic.cpp
 *
 *    Description:  Basic类的实现
 *
 *        Version:  1.0
 *        Created:  2021年08月03日
 *       Revision:  1
 *       Compiler:  gcc
 *
 *         Author:  kevin.wang
 *   Organization:
 *
 * =============================================================================
 */

#include <cstdio>
#include <cstdlib>
#include <iostream>

#include "basic.h"

/*
 * ===  FUNCTION  ==============================================================
 *         Name:  Basic
 *  Description:  默认构造函数
 * =============================================================================
 */
Basic::Basic() {}

/*
 * ===  FUNCTION  ==============================================================
 *         Name:  ~Basic
 *  Description:  默认析构函数
 * =============================================================================
 */
Basic::~Basic() {}

/*
 * ===  FUNCTION  ==============================================================
 *         Name:  Basic
 *  Description:  拷贝构造函数
 * =============================================================================
 */
Basic::Basic(const Basic &theclass) {}

/*
 * ===  FUNCTION  =============================================================
 *         Name:  Display
 *  Description:  显示函数
 * ============================================================================
 */
void Basic::Display() {
        std::cout << "Display" << std::endl;
        std::cout << "Display" << std::endl;
}
