/*
 * =============================================================================
 *
 *       Filename:  basic.cpp
 *
 *    Description:  类介绍 
 *
 *        Version:  1.0
 *        Created:  2021年11月03日 
 *       Revision:  1 
 *       Compiler:  gcc
 *
 *         Author:  kevin.wang 
 *   Organization:  
 *
 * =============================================================================
 */

#include "basic.h"
#include <tuple>

/* 
 * ===  FUNCTION  ==============================================================
 *         Name:  Basic
 *  Description:  默认构造函数 
 * =============================================================================
 */
Basic::Basic () {
}

/* 
 * ===  FUNCTION  ==============================================================
 *         Name:  ~Basic
 *  Description:  默认析构函数 
 * =============================================================================
 */
Basic::~Basic () {
}

/* 
 * ===  FUNCTION  ==============================================================
 *         Name:  Basic 
 *  Description:  拷贝构造函数 
 * =============================================================================
 */
Basic::Basic(const Basic& theclass) {
}

/* 
 * ===  FUNCTION  ==============================================================
 *         Name:  GetValue 
 *  Description:  获取参数 
 * =============================================================================
 */
std::tuple<std::string, int> Basic::GetValue() {
	auto result = std::make_tuple("kevin",10);
	return result;
}
