#include 	"stopstatus.h"

#include 	<iostream>
/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  StopStatus
 *  Description:  默认构造函数 
 * =====================================================================================
 */
StopStatus::StopStatus () {
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  ~StopStatus
 *  Description:  默认析构函数 
 * =====================================================================================
 */
StopStatus::~StopStatus () {
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  StopStatus  
 *  Description:  拷贝构造函数 
 * =====================================================================================
 */
StopStatus::StopStatus(const StopStatus& theclass) {
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  Handle 
 *  Description:  拷贝构造函数 
 * =====================================================================================
 */
void StopStatus::Handle() {
	std::cout << "StopStatus Handle" << std::endl;
}
