/*
 * =============================================================================
 *
 *       Filename:  device.cc
 *
 *    Description:  类介绍 
 *
 *        Version:  1.0
 *        Created:  2021年10月11日 
 *       Revision:  1 
 *       Compiler:  gcc
 *
 *         Author:  kevin.wang 
 *   Organization:  
 *
 * =============================================================================
 */

#include <iostream>
#include "device.h"

/* 
 * ===  FUNCTION  ==============================================================
 *         Name:  Device
 *  Description:  默认构造函数 
 * =============================================================================
 */
// 注意这边需要显示的初始化给智能指针
Device::Device () : mBase(new Base) {
	std::cout << "Device create" << std::endl;
}

/* 
 * ===  FUNCTION  ==============================================================
 *         Name:  ~Device
 *  Description:  默认析构函数 
 * =============================================================================
 */
Device::~Device () {
	std::cout << "Device destroy" << std::endl;
}

/* 
 * ===  FUNCTION  ==============================================================
 *         Name:  Device 
 *  Description:  拷贝构造函数 
 * =============================================================================
 */
Device::Device(const Device& theclass) {
}

/* 
 * ===  FUNCTION  =============================================================
 *         Name:  Display 
 *  Description:  显示 
 * ============================================================================
 */
void Device::Display() {
	mBase->Display();
}
