/*
 * =============================================================================
 *
 *       Filename:  timers.c
 *
 *    Description:  定时器相关代码 
 *
 *        Version:  1.0
 *        Created:  2021年12月15日 
 *       Revision:  1 
 *       Compiler:  gcc
 *
 *         Author:  kevin.wang 
 *   Organization:  
 *
 * =============================================================================
 */

/* 
 * ===  FUNCTION  =============================================================
 *         Name:  init_timer
 *  Description:  初始化定时器相关代码 
 * ============================================================================
 */
int init_timer() {
	return 0;
}
