/*
 * =====================================================================================
 *
 *       Filename:  Base.cpp
 *
 *    Description:  类介绍 
 *
 *        Version:  1.0
 *        Created:  2020年10月09日 
 *       Revision:  1 
 *       Compiler:  gcc
 *
 *         Author:  kevin.wang 
 *   Organization:  
 *
 * =====================================================================================
 */

#include "base.h"

#include <iostream>

namespace cppstyle {
/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  Base
 *  Description:  默认构造函数 
 * =====================================================================================
 */
Base::Base () {
	std::cout << "Base create" << std::endl;
	std::cout << id_ << std::endl;
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  ~Base
 *  Description:  默认析构函数 
 * =====================================================================================
 */
Base::~Base () {
	std::cout << "Base destroy" << std::endl;
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  Base  
 *  Description:  拷贝构造函数 
 * =====================================================================================
 */
Base::Base(const Base& theclass) {
}

} /* namespace cppstyle */
